// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Cancel";
"SHUTDOWN_BUTTON"	= "Shut Down";
"SKIP_BUTTON"		= "Skip";
"QUIT_BUTTON"		= "Quit";
"GO_BUTTON"		= "Go";

"CONNECT_BUTTON"	= "Connect";
"CONTINUE_BUTTON"	= "Continue";
"RECONNECT_BUTTON"	= "Try Again";
"GO_BACK_BUTTON"	= "Go Back";
"REGISTER_LATER_BUTTON"	= "Register Later";
"DONT_ACCEPT_BUTTON"	= "Don’t Accept";
"LEARNMORE_BUTTON"	= "Learn More";

"SYSTEM_PREFERENCES_BUTTON" = "Open System Preferences";

"SYSTEM_PREFERENCES" = "System Preferences";

// HEADING_FONT : use legal postscript name [4890740]
"HEADING_FONT" = "LucidaGrande"; 
"HEADING_SIZE" = "42";
"HEADING_KERNING" = "-2";

"REGISTRATION_FILE_PATH" = "%@/Library/Assistants/Send Registration.setup";
"REGISTRATION_FILE_ALIAS_PATH" = "%@/Send Registration";

"LOCAL_ADMIN_SHORT_NAME" = "admin";
"LOCAL_ADMIN_FULL_NAME" = "Administrator";

"OTHER_AIRPORT_NETWORK" = "Other Network";
// ---------------------------------------------------------------------
// * Migration
// ---------------------------------------------------------------------
"Successfully connected to the other Mac..." = "Successfully connected to the other Mac...";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Configuring your computer…";
"MESSAGE_PREP_CONNECTION"	= "Preparing to connect…";
"MESSAGE_CONNECTING"		= "Connecting to Apple…";
"MESSAGE_DISCONNECTING"		= "Disconnecting…";
"MESSAGE_REGISTRATION_SENT"	= "Your registration was sent to Apple.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_STARTUP_CANNOT_RUN_TITLE"		= "Setup Assistant can’t be used to set up your computer.";
"MESSAGE_STARTUP_CANNOT_RUN"			= "To change your computer’s settings, choose Apple () > System Preferences instead.";

"MESSAGE_MONITOR_CANNOT_RUN_TITLE"		= "The Mac OS X Setup Assistant cannot be used with this monitor.";
"MESSAGE_MONITOR_CANNOT_RUN"			= "To set up your computer, choose System Preferences from the Apple menu. To register your product, go to www.apple.com/register";

"MESSAGE_SPEAKER_CONNECTION_TITLE"		= "The device plugged in to the Apple speaker mini-jack can’t be recognized.";
"MESSAGE_SPEAKER_CONNECTION"			= "Remove the plug from the jack. Then plug it back in and make sure it is fully inserted.";

"MESSAGE_CONNECTION_FAILED_TITLE"		= "Your registration could not be sent.";
"MESSAGE_CONNECTION_FAILED"				= "The computer can’t connect to Apple because the connection is busy or your network settings are incorrect. Click Try Again to go back and change your settings, or you can send your registration later.";
"MESSAGE_CONNECTION_FAILED_REGLATER"	= "The connection to Apple is busy or your computer could not connect to the Internet. Check your network settings, or connect to the Internet before sending your registration.";

"MESSAGE_CONNECTION_CANCELED_TITLE"		= "Canceled…";
"MESSAGE_CONNECTION_CANCELED"			= "Please be sure to register your product later.";

"MESSAGE_REGISTRATION_FAILED_TITLE"		= "Your registration can’t be processed at this time.";
"MESSAGE_REGISTRATION_FAILED"			= "You can complete your registration later by opening the Send Registration file located in your home folder.";

"MESSAGE_AUTHENTICATION_FAILED_TITLE"	= "Your account information is incorrect.";
"MESSAGE_AUTHENTICATION_FAILED"			= "The account information you entered was rejected by your Internet service provider. Click Go Back, correct the information, and then try again.";

"MESSAGE_CC_VALIDATION_FAILED_TITLE"	= "Your credit card could not be processed.";
"MESSAGE_CC_VALIDATION_FAILED"			= "The credit card you entered could not be used. Click Go Back to make sure the credit card information is correct or enter a different credit card, and then try again.";

"MESSAGE_INVALID_ADDRESS_TITLE"			= "There was a problem with your address information.";
"MESSAGE_INVALID_ADDRESS"				= "Click Go Back to make sure the city, zip or postal code, state, and province or county information is correct, and then try again.";


"MESSAGE_INVALID_REGISTRATION_TITLE"	= "There is a problem with your registration information.";
"MESSAGE_INVALID_FIRSTNAME"				= "There is an error with the name that you entered. Click Go Back to make sure your first name is correct, and then try again.";
"MESSAGE_INVALID_LASTNAME"				= "There is an error with the name that you entered. Click Go Back to make sure your last name is correct, and then try again.";
"MESSAGE_INVALID_PHONE_NUMBER"			= "There is an error with the telephone number that you entered. Click Go Back to make sure your telephone number is correct, and then try again.";


"MESSAGE_NO_DIAL_TONE_TITLE"			= "Your modem can’t detect a dial tone.";
"MESSAGE_NO_DIAL_TONE"					= "Make sure your modem is connected and then click OK. Or, click Cancel to go back and select the “Ignore dial tone” checkbox.";

"MESSAGE_CC_IN_USE_TITLE"				= "You can’t create an account using this credit card.";
"MESSAGE_CC_IN_USE"						= "This credit card has already been used to create an account with this Internet service provider. Click Go Back and enter information for a different credit card or contact the provider.";

"MESSAGE_DOTMAC_WEB_CANCELLED_TITLE"	= "The MobileMe signup process was canceled.";
"MESSAGE_DOTMAC_WEB_CANCELLED"			= "You can click Try Again to reconnect with MobileMe or cancel the MobileMe signup process and continue setting up your computer.";

"MESSAGE_NO_HINT_WARNING_TITLE"			= "You haven’t provided password hint.";
"MESSAGE_NO_HINT_WARNING"				= "Are you sure you don’t want to enter a password hint? If you forget your password, you’ll have to reset it.";

// ---------------------------------------------------------------------
// * Quit prematually
// ---------------------------------------------------------------------
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT_TITLE" = "Do you want to shut down your computer?";
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT" = "You haven’t finished setting up Mac OS X.";
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT_CAN_SKIP" = "You haven’t finished setting up Mac OS X. You can click Skip now to skip the registration process.";

"MESSAGE_QUIT_TITLE" = "Are you sure you want to quit?";

"MESSAGE_QUIT_NO_REGISTRATION"  = "If you quit now, your registration will not be sent to Apple.";
"MESSAGE_QUIT_REGISTER_LATER" = "If you want to continue with the setup, but do not want to complete your registration now, click Register Later.";

"MESSAGE_CANCEL_TITLE" = "Are you sure?";

"MESSAGE_SKIP_USER_INFO" = "If you don’t want to send your personal information, click Continue.";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "An unexpected error occurred.";
"MESSAGE_FATAL_ERROR_TITLE"		= "Sorry, an unexpected error has occurred.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Error";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Sorry…";

// ---------------------------------------------------------------------
// * Support API error
// ---------------------------------------------------------------------
"ERROR_MESSAGE_NetworkConfigure"		= "[Network configuration failed]";
"ERROR_MESSAGE_ICConfigure"				= "[Internet configuration failed]";
"ERROR_MESSAGE_UserConfigureFirstTime" 	= "[Local account creation failed]";

"ERROR_MESSAGE_NetworkConfigureFailed" = "Your network connection could not be configured. You will not be able to send your registration information or connect to the Internet. Click Cancel to change your network settings, or click OK to finish anyway.";
// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Sorry";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Warning";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Do you want to continue?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "You haven’t provided all of the requested information.";
"ERROR_MESSAGE_VALIDATION_0001" = "To enter the information, click Go Back and check the fields marked with red arrows.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "The text you entered is too short.";
"ERROR_MESSAGE_VALIDATION_0002" = "Check the highlighted field and correct the text.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "The information you entered is incorrect. Reenter your information, making sure it’s correct.";

                    // NI Username/Password invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "The user name or password you entered is not correct, or login is disabled.";
"ERROR_MESSAGE_VALIDATION_0004" = "Try entering your information again or contact the server administrator.";

                    // NI Password invalid 
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "The user name or password you entered is not correct, or login is disabled.";
"ERROR_MESSAGE_VALIDATION_0005" = "Try entering your information again or contact the server administrator.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "The name you entered can’t be used.";
"ERROR_MESSAGE_VALIDATION_0006" = "Check the highlighted field and enter a different account name.";

"ERROR_MESSAGE_VALIDATION_0007_TITLE" = "The name you entered can’t be used.";
"ERROR_MESSAGE_VALIDATION_0007" = "This name is not available. Enter a different name.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "The IP address field is empty. Enter your IP address, making sure it’s correct.";
"ERROR_MESSAGE_VALIDATION_0010" = "The IP address you entered contains invalid characters. Reenter your IP address, making sure it’s correct.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "The address must contain 4 segments."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "The address must contain 4 segments."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Each address segment must contain between 1 and 3 characters."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "The address you entered is not allowed.";
"ERROR_MESSAGE_VALIDATION_0014" = "Check the highlighted field and enter a valid address. If you don’t know this information, ask your network administrator.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "The subnet mask you entered is not correct.";
"ERROR_MESSAGE_VALIDATION_0015" = "Check the highlighted field and enter a valid subnet mask. If you don’t know this information, ask your network administrator.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "An Open Directory account already exists with this name. If you use this name, you can’t access the existing account.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "The fields can’t have the same value.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "The password you entered is invalid.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "The credit card number you entered can’t be used.";
"ERROR_MESSAGE_VALIDATION_0019" = "Check the highlighted field and enter a valid credit card number.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Your account name can’t begin with a number.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "The email address you entered might be unusable.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "The IP address and the router address are not consistent with the subnet mask you entered. Check the following fields and enter valid values:\n     IP address\n     Subnet mask\n     Router address\nIf you don’t know this information, ask your network administrator.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "The name you entered can’t be used.";
"ERROR_MESSAGE_VALIDATION_0023" = "Check the highlighted field and enter a different name.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "There is duplicate information.";
"ERROR_MESSAGE_VALIDATION_0024" = "Check the highlighted field and enter unique values.";

					// Wireless join errors
"ERROR_MESSAGE_VALIDATION_0025_TITLE" = "This computer is not in the base station’s access control list.";
"ERROR_MESSAGE_VALIDATION_0025" = "You must add this computer to the base station’s access control list.";
"ERROR_MESSAGE_VALIDATION_0026_TITLE" = "There was an error joining the selected network.";
"ERROR_MESSAGE_VALIDATION_0026" = "Check your AirPort settings or try joining a different network.";
					
                    // Required field for registration
"ERROR_MESSAGE_VALIDATION_0027_TITLE" = "Some of your registration information is missing.";
"ERROR_MESSAGE_VALIDATION_0027" = "To enter the information, click Go Back and check the fields marked with red arrows.";

                    // Registration server validation (from 1000-)
"ERROR_MESSAGE_VALIDATION_1000" = "Enter a valid postal code.";
"ERROR_MESSAGE_VALIDATION_1001" = "Enter a valid area code.";
"ERROR_MESSAGE_VALIDATION_1002" = "Enter a valid local number.";
"ERROR_MESSAGE_VALIDATION_1003" = "Enter a valid phone number.";

                    // AppleCareAgreement validation (from 2000-)
"ERROR_MESSAGE_VALIDATION_2000_TITLE" = "The agreement number you entered is not valid.";
"ERROR_MESSAGE_VALIDATION_2000" = "The agreement number must be 12 or 15 digits.";

                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "The passwords don’t match.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Check the fields marked with red arrows and enter the same password in both fields.";

"ERROR_NO_PASSWORD_INSECURE_TITLE" = "You haven’t entered a password for your user account.";
"ERROR_NO_PASSWORD_INSECURE" = "If your user account doesn’t have a password, your computer will not be secure. Click Cancel to enter a password.";

"ERROR_NIUSERNAME_EXISTS_LONGNAME_TITLE" = "An Open Directory account already exists with this long name.";
"ERROR_NIUSERNAME_EXISTS_LONGNAME" = "If you use this name, you can’t access the existing user account. Do you really want to create a local account with this name?";

"ERROR_NIUSERNAME_EXISTS_SHORTNAME_TITLE" = "An Open Directory account already exists with this name.";
"ERROR_NIUSERNAME_EXISTS_SHORTNAME" = "If you use this name, you can’t access the existing user account. Do you really want to create a local account with this name?";

"ERROR_IP_AND_ROUTER_TITLE" = "Are you sure you want your IP address and router address to be the same?";
"ERROR_IP_AND_ROUTER" = "Having the same IP and router address may cause network problems. If you don’t know your IP and router address, ask your network administrator before continuing.";

"ERROR_POSTAL_USA_TITLE" = "The zip code you entered is not valid.";
"ERROR_POSTAL_USA" = "The zip code must have 5 digits, or 9 digits for zip+4 zip codes, and it must be in the format XXXXX-XXXX, where the X’s are the digits in your zip code.";

"ERROR_POSTAL_JAPAN_TITLE" = "The postal code you entered is not valid.";
"ERROR_POSTAL_JAPAN" = "The postal code must have 7 digits, and must be in the format XXX-XXXX, where the X’s are the digits in your postal code.";

"ERROR_POSTAL_OTHER_TITLE" = "The postal code you entered is not valid.";
"ERROR_POSTAL_OTHER" = "The postal code must be shorter than 32 characters.";

"ERROR_AREA_CODE_CANADA_USA_TITLE" = "The area code you entered is not valid.";
"ERROR_AREA_CODE_CANADA_USA" = "The area code must be greater than 200, and cannot be 411, 611, or 911.";

"ERROR_LOCAL_NUMBER_CANADA_USA_TITLE" = "The local phone number you entered is not valid.";
"ERROR_LOCAL_NUMBER_CANADA_USA" = "The exchange number must be greater than 200, and can’t be 411, 611, or 911. Reenter your phone number, making sure you enter it correctly.";

"ERROR_EXCHANGE_NUMBER_CANADA_USA_TITLE" = "The local phone number you entered is not valid.";
"ERROR_EXCHANGE_NUMBER_CANADA_USA" = "The exchange number can’t be 555 for the area code you entered. Reenter your phone number, making sure you enter it correctly.";

"ERROR_PHONE_NUMBER_JAPAN_TITLE" = "The phone number you entered is not valid.";
"ERROR_PHONE_NUMBER_JAPAN" = "The phone number must have at least 10 digits.";

"ERROR_PHONE_NUMBER_CANADA_USA_TITLE" = "The phone number you entered is not valid.";
"ERROR_PHONE_NUMBER_CANADA_USA" = "The phone number must have 10 digits.";

"ERROR_USERNAME_AND_PASSWORD_TITLE" = "The user name and password can’t be the same.";
"ERROR_USERNAME_AND_PASSWORD"		= "This is a security risk. Enter a different password.";

"ERROR_UNIQUE_DNS_ENTRIES_TITLE" = "There are duplicate DNS entries.";
"ERROR_UNIQUE_DNS_ENTRIES"		= "Check the highlighted field and enter unique DNS values.";

"ERROR_PASSWORD_CANNOT_BE_HINT_TITLE" = "The hint and the password can’t be the same.";
"ERROR_PASSWORD_CANNOT_BE_HINT"		= "This is a security risk. Enter a different hint or password.";

"American Express"			= "American Express";
"MasterCard"				= "MasterCard";
"Visa"					= "VISA";
"JCB"					= "JCB";
"E-On"					= "E-On";
"Million"				= "Million";
"Internet Service Plan"                 = "Internet Service Plan";

"FADE_STRING_1" = "Mac OS X 10.5 Leopard";
"FADE_STRING_2" = "Getting Started";
